In [21]:
import pandas as pd
import numpy as np
import re

In [2]:
transactions = pd.read_csv("transactions.csv")
transactions.head(2)

,Unnamed: 0,client_id,product_category,product_company,subtype,amount,date,transaction_type
0,34478,37,29,NaN,Автоплатеж,1209,2020-01-01 00:00:00,Negative
1,65406,71,4,YouTube Music,Подписка,169,2020-01-01 00:00:00,Negative

In [3]:
transact = transactions.drop(['Unnamed: 0', 'product_category', 'product_company', 'subtype'], axis=1)

transact[transact['transaction_type'] == 'Positive'].head(5)

    client_id  amount                 date transaction_type
38        447    2531  2020-01-01 00:03:58         Positive
48        883    1387  2020-01-01 00:09:10         Positive
51        148    1172  2020-01-01 00:09:25         Positive
68        183     987  2020-01-01 00:18:31         Positive
99        739    1653  2020-01-01 00:30:49         Positive

In [4]:
transact.size

3716540

In [5]:
transact.shape

(929135, 4)

In [6]:
transact.sort_values('client_id')

        client_id  amount                 date transaction_type
304473          1      58  2020-04-29 21:47:55         Negative
397721          1     297  2020-06-05 18:50:08         Negative
697827          1    1831  2020-10-02 00:10:16         Positive
359803          1      65  2020-05-21 20:29:01         Negative
474644          1    2405  2020-07-06 01:35:15         Negative
...           ...     ...                  ...              ...
333654       1000    3735  2020-05-11 11:26:23         Negative
612935       1000    2814  2020-08-29 10:38:17         Negative
386533       1000     518  2020-06-01 07:39:19         Negative
584621       1000      75  2020-08-18 09:39:45         Negative
775232       1000      54  2020-11-01 10:41:58         Negative

[929135 rows x 4 columns]

In [7]:
t = transact
t['amount'][t['client_id'] == 1000].sum()

1070457

In [8]:
df1 = pd.read_csv("transactions_1.csv")

In [9]:
df2 = pd.read_csv("transactions_2.csv")

In [10]:
df3 = pd.read_csv("transactions_3.csv")

In [11]:
df4 = pd.read_csv("transactions_4.csv")

In [12]:
df5 = pd.read_csv("transactions_5.csv")

In [13]:
df6 = pd.read_csv("transactions_6.csv")

In [14]:
df7 = pd.read_csv("transactions_7.csv")

In [15]:
df8 = pd.read_csv("transactions_8.csv")

In [16]:
df9 = pd.read_csv("transactions_9.csv")

In [17]:
df10 = pd.read_csv("transactions_10.csv")

In [18]:
dfz = df1.append(df2).append(df3).append(df4).append(df5).append(df6).append(df7).append(df8).append(df9).append(df10)
dfz.head()

   client_id  amount  sent(0=no)  contact_id        date  time
0        417  $92.52           1         441   7/25/2020  5:35
1        356  $21.19           0         125   8/10/2020  8:20
2        484  $20.24           1          51  10/14/2020  4:01
3        474  $94.20           1         206   10/5/2020  4:03
4        388  $67.04           0         244   10/5/2020  5:08

In [19]:
dfz.shape

(10000, 6)

In [71]:
dfz.sort_values('client_id')

     client_id    amount  sent(0=no)  contact_id        date   time
209          1   $344.89           0         125    4/3/2020  20:26
636          1    $34.39           0         302   8/30/2020   9:04
827          1    $66.75           0         284  12/19/2020   8:19
228          1    $17.38           0         372  11/25/2020  17:43
575          1   $183.21           0         188   4/20/2020  11:56
..         ...       ...         ...         ...         ...    ...
647        485   $541.65           0         437  10/24/2020  19:33
40         485  $1024.91           0         156   8/18/2020  15:34
888        485   $574.90           0         379   9/13/2020  23:30
200        485   $327.15           1         458  10/13/2020  13:07
97         485   $226.80           1         297   7/23/2020   2:22

[10000 rows x 6 columns]

In [72]:
dfz['amount'][dfz['client_id'] == 485].sum()

'$19.66$38.06$18.68$0.49$6.70$124.93$109.67$121.50$28.47$56.00$51.00$226.80$216.63$285.59$129.79$327.15$37.07$450.40$108.53$540.13$166.37$131.11$866.68$574.90$1024.91$442.36$1851.52$541.65$1291.72$1554.07'

In [25]:
num = r'([0-9]{1-5}.[0-9]{2})'

In [59]:
dfz.amount.str.replace('$', 'J')
dfz

     client_id    amount  sent(0=no)  contact_id        date   time
0          417    $92.52           1         441   7/25/2020   5:35
1          356    $21.19           0         125   8/10/2020   8:20
2          484    $20.24           1          51  10/14/2020   4:01
3          474    $94.20           1         206   10/5/2020   4:03
4          388    $67.04           0         244   10/5/2020   5:08
..         ...       ...         ...         ...         ...    ...
995        412  $1967.68           1         460    9/6/2020  10:39
996        307    $72.20           0          36   9/22/2020   6:13
997         10   $576.35           0         212   12/3/2020  12:28
998        475   $418.86           1         172   4/29/2020  19:29
999        156  $1481.93           0         318  10/30/2020  11:57

[10000 rows x 6 columns]

In [41]:
a=lambda x: str(x).split(',')
dfz['amount'].apply(a)

0        [$92.52]
1        [$21.19]
2        [$20.24]
3        [$94.20]
4        [$67.04]
          ...
995    [$1967.68]
996      [$72.20]
997     [$576.35]
998     [$418.86]
999    [$1481.93]
Name: amount, Length: 10000, dtype: object

In [49]:
dfz['amount'] = dfz['amount'].astype(str)

In [50]:
dfz.dtypes

client_id      int64
amount        object
sent(0=no)     int64
contact_id     int64
date          object
time          object
dtype: object